Introduction to dataframes

import pandas as pd

Creating Dataframes from Scratch

Dataframe = multicolumn data each colum represents a different variable, every column contains data of its own type

Information can potentially be heterogeneous unlike a series where it is of a single type

A dataframe is a two dimensional datstructure it is the closest thing to a standard two dimensional spreadsheet

You need 2 points of reference in a dataframe a row index and a column index

Construct a datframe from a dictionary of lists

In [50]:
import pandas as pd

In [52]:
data = {'ProductName' :['Product A', 'Product B', 'Product C'], 'ProductPrice':[22250, 16600, 12500]}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

One should always be careful of the number of records and dimensions you provide

# Construct a dataframe from a dictionary of list + specify an index

In [56]:
data ={'ProductNmae' :['Product A', 'Product B', 'Product C'], 'ProductPrice' : [22250, 16600, 12500]}
df = pd.DataFrame(data, index = ['A', 'B', 'C'])
df

  ProductNmae  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [58]:
data ={'ProductNmae' :['Product A', 'Product B', 'Product C'], 'ProductPrice' : [22250, 16600, 12500]}
product_IDs = ['A', 'B', 'C']
df = pd.DataFrame(data, index =product_IDs)
df

  ProductNmae  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500


Constructing Dataframe from a list of dictionaries

In [61]:
data = [{'ProductName':'Product A', 'ProductPrice': 22250},
        {'ProductName': 'Product B', 'ProductPrice':16600},
        {'ProductName': 'Product C', 'ProductPrice' : 12500}]
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [62]:
data = [{'ProductName':'Product A', 'ProductPrice': 22250},
        {'ProductName': 'Product B', 'ProductPrice':16600},
        {'ProductName': 'Product C', 'ProductPrice' : [12500, 100000]}]
df =pd.DataFrame(data)
df

  ProductName     ProductPrice
0   Product A            22250
1   Product B            16600
2   Product C  [12500, 100000]

In [65]:
data = [{'ProductName':'Product A', 'ProductPrice': 22250},
        {'ProductName': 'Product B', 'ProductPrice':16600},
        {'ProductName': 'Product C', 'ProductPrice' : 12500},
       {'ProductName' : 'Product D'}]
df =pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A       22250.0
1   Product B       16600.0
2   Product C       12500.0
3   Product D           NaN

In [68]:
import pandas as pd 
data = {
    'Name' : ['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'],
    'Age' : ['50','53','35','43'],
    'Working Experience(Yrs.)' : ['5', '8', '3', '10']
    }
df = pd.DataFrame(data)
print(df)

                 Name Age Working Experience(Yrs.)
0           Amy White  50                        5
1        Jack Stewart  53                        8
2  Richard Lauderdale  35                        3
3        Sara Johnson  43                       10

Construct a DataFrame from a dictionary of pandas Series

In [71]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'])
ser_prices = pd.Series([22250, 16600, 12500])

In [73]:
data = {'ProductName':ser_products, 'ProductPrice':ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [75]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'], index = ['A', 'B', 'C'])
ser_prices = pd.Series([22250, 16600, 12500], index = ['A', 'B', 'C'])
data = {'ProductName':ser_products, 'ProductPrice':ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [77]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'], index = ['A', 'B', 'C'])
ser_prices = pd.Series([22250, 16600, 12500], index = ['C', 'B', 'A'])
data = {'ProductName':ser_products, 'ProductPrice':ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
A   Product A         12500
B   Product B         16600
C   Product C         22250

Python reorganises the value of every row the purpose is to respond to the order provided in the index of the first series


Construct a DataFrame from a list of losts

In [81]:
data=[['Product A', 22250],['Product B', 16600], ['Product C', 12500]]
df = pd.DataFrame(data)
df

           0      1
0  Product A  22250
1  Product B  16600
2  Product C  12500

In [83]:
df.columns = ['ProductName','ProductPrice']
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [85]:
df.index = ['A', 'B','C']
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

Constructing DataFrames in a professional way

In [88]:
df =pd.DataFrame(data = [['Product A',22250], ['Product B', 16600],['Product C', 12500]],
                 columns = ['ProductName', 'ProductPrice'],
                 index = ['A','B','C'])
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [90]:
df.shape

(3, 2)

Use pandas to create the following DataFrame, and call it df:To complete the task, create a dictionary called data where the values should be pandas Series. Store the pandas Series in variables named names, age, and working_experience_yrs.

In [3]:
import pandas as pd 
ser_names = pd.Series(['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'])
ser_age = pd.Series([50, 53, 35, 43])
ser_working_experience_yrs = pd.Series([5, 8, 3, 10])
data = {
    'Name' : ser_names, 
    'Age' : ser_age, 
    'Working Experience (Yrs.)' : ser_working_experience_yrs
    }
df = pd.DataFrame(data)
print(df)

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

To complete the task, create a list called data where the values should be lists.

In [1]:
import pandas as pd 
data = [
    ['Amy White', 50, 5],
    ['Jack Stewart', 53, 8],
    ['Richard Lauderdale', 35, 3],
    ['Sara Johnson', 43, 10]
    ]
columns = ['Name','Age', 'Working Experience (Yrs.)']
df = pd.DataFrame(data, columns=columns)
print(df)

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

In [6]:
df.index = [1, 2, 3, 4]
df

                 Name  Age  Working Experience (Yrs.)
1           Amy White   50                          5
2        Jack Stewart   53                          8
3  Richard Lauderdale   35                          3
4        Sara Johnson   43                         10